list1 = [
  "系统名称",
  "系统编号",
  "系统状态",
  "是否为子系统",
  "是否为重要系统",
  "保障等级",
  "运维负责人工号",
  "运维负责人姓名",
  "部门",
  "部门名称",
  "不合规下游系统0",
  "不合规下游系统0的保障等级",
  "不合规下游系统1",
  "不合规下游系统1的保障等级"
]
dict1 = {
  "保障等级": "B1",
  "系统名称": "高速行情分发系统",
  "不合规下游系统0": "复杂交易订单系统",
  "是否为重要系统": "否",
  "部门名称": "应用运维一室（核心）",
  "系统编号": "S220",
  "不合规下游系统1的保障等级": "B2",
  "是否为子系统": "父系统",
  "部门": "6276",
  "系统状态": "已上线",
  "不合规下游系统1": "金智投交易终端系统",
  "运维负责人工号": "xiezc",
  "不合规下游系统0的保障等级": "A1",
  "运维负责人姓名": "谢志存"
}
order_dict1 = dict(sorted(dict1.items(), key=lambda x: list1.index(x[0])))
print(order_dict1)
